FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_GPDMA.c
T_uezError LPC17xx_40xx_GPDMA_InitializeWorkspace_ChannelX(
    void *aWorkspace,
    TUInt8 aChannel)
{
    T_LPC17xx_40xx_GPDMA_Workspace *p = (T_LPC17xx_40xx_GPDMA_Workspace *)aWorkspace;

    // Setup GPDMA peripheral
    LPC17xx_40xx_GPDMA_Enable(aWorkspace);

    // channel X
    p->iChannel = aChannel;

    // Fill the structure with default value for control and attributes.
    p->iControl = 0;
    p->iISRCallback = 0;
    p->iLinkedList = 0;
    p->iSource = 0;
    p->iDestination = 0;

    // Make local reference to the created workspace. Used in interrupt handler.
    G_workspaceGPDMAChannel[aChannel] = aWorkspace;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPDMA_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC17xx_40xx GPDMA iChannel workspaces.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel0(void *aWorkspace)
{
    return LPC17xx_40xx_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL0);
}
T_uezError LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel1(void *aWorkspace)
{
    return LPC17xx_40xx_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL1);
}
T_uezError LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel2(void *aWorkspace)
{
    return LPC17xx_40xx_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL2);
}
T_uezError LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel3(void *aWorkspace)
{
    return LPC17xx_40xx_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL3);
}
T_uezError LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel4(void *aWorkspace)
{
    return LPC17xx_40xx_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL4);
}
T_uezError LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel5(void *aWorkspace)
{
    return LPC17xx_40xx_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL5);
}
T_uezError LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel6(void *aWorkspace)
{
    return LPC17xx_40xx_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL6);
}
T_uezError LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel7(void *aWorkspace)
{
    return LPC17xx_40xx_GPDMA_InitializeWorkspace_ChannelX(aWorkspace,
        GPDMA_CHANNEL7);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPDMA_Stop
 *---------------------------------------------------------------------------*
 * Description:
 *      Disable GPDMA iChannel. Data is lost if is in DMA FIFO.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPDMA_Stop(void *aWorkspace)
{

    T_LPC17xx_40xx_GPDMA_Workspace *p = (T_LPC17xx_40xx_GPDMA_Workspace *)aWorkspace;

    // Zero out the enable bit
    G_channelRegs[p->iChannel]->CConfig &= ~(1 << 0);

#if 0 // currently not supported
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP0_TX)
    SSP0DMACR &= ~SSP0DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP0_RX)
    SSP0DMACR &= ~SSP0DMACR_RXDMAE_MASK;
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP1_TX)
    SSP1DMACR &= ~SSP1DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP1_RX)
    SSP1DMACR &= ~SSP1DMACR_RXDMAE_MASK;
#endif
    // Fill the structure with default value for iControl and attributes.
    p->iControl = 0;

    return UEZ_ERROR_NONE;

}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPDMA_ChannelIsEnabled
 *---------------------------------------------------------------------------*
 * Description:
 *      Check if GPDMA iChannel is enabled -> transfer in progress.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      TBool                   -- Enabled ETrue else EFalse
 *---------------------------------------------------------------------------*/
static TBool LPC17xx_40xx_GPDMA_ChannelIsEnabled(void *aWorkspace)
{
    T_LPC17xx_40xx_GPDMA_Workspace *p = (T_LPC17xx_40xx_GPDMA_Workspace *)aWorkspace;

    // Enabled iChannel
    return (LPC_GPDMA->EnbldChns & (1 << p->iChannel)) ? ETrue : EFalse;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPDMA_Start
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable GPDMA iChannel -> begin new transfer.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPDMA_Start(void *aWorkspace)
{
//    TUInt32 regValue = 0;
    T_LPC17xx_40xx_GPDMA_Workspace *p = (T_LPC17xx_40xx_GPDMA_Workspace *)aWorkspace;
    LPC_GPDMACH_TypeDef *p_channel;

    // Test if we can enable the iChannel.
    if (p->iControl == 0 || ETrue == LPC17xx_40xx_GPDMA_ChannelIsEnabled(aWorkspace))
        return UEZ_ERROR_NOT_READY;

    //Clear any pending interrupts on the iChannel
    LPC_GPDMA->IntTCClear = 1 << p->iChannel;
    LPC_GPDMA->IntErrClr = 1 << p->iChannel;

    // Memory to memory transfer;
//    regValue |= ((0x0 & DMACCConfiguration_FlowCntrl_MASK)
//            << DMACCConfiguration_FlowCntrl_BIT) | DMACCConfiguration_E;

    // If the callback is set, process interrupts.
//    if (NULL != p->iISRCallback)
//        regValue |= DMACCConfiguration_IE | DMACCConfiguration_ITC;

    p_channel = G_channelRegs[p->iChannel];
    p_channel->CSrcAddr = p->iSource;
    p_channel->CDestAddr = p->iDestination;

    // linked list?
    p_channel->CLLI = p->iLinkedList;

