FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_GPDMA.c
    // Write the iControl information into the DMACCxControl Register
    p_channel->CControl = p->iControl;

    // Enable iChannel.
    p_channel->CConfig = p->iConfiguration;

#if 0 // Not currently supported
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP0_TX)
    SSP0DMACR |= SSP0DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP0_RX)
    SSP0DMACR |= SSP0DMACR_RXDMAE_MASK;
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP1_TX)
    SSP1DMACR |= SSP1DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP1_RX)
    SSP1DMACR |= SSP1DMACR_RXDMAE_MASK;
#endif

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPDMA_Enable
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable GPDMA controller and register interrupt handler.
 * Inputs:
 *      void *aW                    -- Particular GPDMA workspace
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
static void LPC17xx_40xx_GPDMA_Enable(void *aWorkspace)
{
    (void)aWorkspace;

    // Increase number of G_opened channels.
    G_opened++;

    // Enable peripheral power (PCGPDMA)
    LPC17xx_40xxPowerOn(1 << 29);

    // Was registered already?
    if (EFalse == InterruptIsRegistered(INTERRUPT_CHANNEL_GP_DMA)) {
        // Enable interrupt.
        InterruptRegister(INTERRUPT_CHANNEL_GP_DMA, (TISRFPtr)IGPDMA,
            INTERRUPT_PRIORITY_NORMAL, "GPDMA");
        InterruptEnable(INTERRUPT_CHANNEL_GP_DMA);
    }

    // Enable GPDMA by writing ENABLE bit.
    // Always little-endian.
    LPC_GPDMA->Config = DMACCConfiguration_E;
}

/*---------------------------------------------------------------------------*
 * Routine:  IPeripheralToIndex
 *---------------------------------------------------------------------------*
 * Description:
 *      Convert a peripheral number into an index in the DMA registers.
 * Inputs:
 *      T_gpdmaRequest aPeripherl   -- Peripheral type from Types/GPDMA.h
 * Outputs:
 *      TUInt32 -- Index or GPDMA_PERIPHERAL_UNKNOWN if unknown
 *---------------------------------------------------------------------------*/
static TUInt32 IPeripheralToIndex(T_gpdmaPeripheral aPeripheral)
{
    TUInt32 index = GPDMA_PERIPHERAL_UNKNOWN;
    if (aPeripheral <= GPDMA_PERIPHERAL_UART4_RX) {
        return G_peripheralMap[aPeripheral] & GPDMA_PERIPHERAL_MASK;
    }
    return index;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPDMA_PrepareRequest
 *---------------------------------------------------------------------------*
 * Description:
 *      Set up GPDMA iChannel.
 * Inputs:
 *      void *aW                       -- Particular GPDMA workspace
 *      const T_gpdmaRequest *aRequest -- Request to prepare
 *      T_gpdmaCallback aISRCallback   -- Routine to call when complete, or 0
 *                                       for none.
 *      void *aISRCallbackWorksspace   -- Pointer to data passed to callback
 *                                         routine.
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPDMA_PrepareRequest(
    void *aWorkspace,
    const T_gpdmaRequest *aRequest,
    T_gpdmaCallback aISRCallback,
    void *aISRCallbackWorkspace)
{
    TUInt32 control;
    TUInt32 flow;
    TUInt32 perip;

    T_LPC17xx_40xx_GPDMA_Workspace *p = (T_LPC17xx_40xx_GPDMA_Workspace *)aWorkspace;

    // Load the destination & source address into the iControl block.
    // (Note: These only apply to memory transfers)
    p->iSource = (TUInt32)aRequest->iSourceAddr;
    p->iDestination = (TUInt32)aRequest->iDestinationAddr;

    // Load the iControl word.
    control = aRequest->iControl;

    // Channel 0 and 1 have the same defines, so only iChannel 0 is used.

    // Set the transfer size and mode in the iControl word.
    control |= (aRequest->iNumTransferItems << DMACCControl_TransferSize_BIT)
        & DMACCControl_TransferSize_MASK;

    // DMA Scatter-Gather?
    p->iLinkedList = (TUInt32)aRequest->iLinkedList;

    // Callback for DMA end or error?
    p->iISRCallback = aISRCallback;
    p->iISRCallbackWorkspace = aISRCallbackWorkspace;
    if (aISRCallback)
        control |= GPDMA_INT_ENABLE;

    // Bufferable and Cacheable. 0b110.
    control |= (0x6 << DMACCControl_Prot_BIT) & DMACCControl_Prot_MASK;

    // Store iControl value.
    p->iControl = control;

    // Flow control is to be determined by the various types
    // General output to match Table 675 from UM102347: LPC17xx_40xx user's manual
    flow = 0;
    p->iSourcePeripheral = aRequest->iSourcePeripheral;
    p->iDestinationPeripheral = aRequest->iDestinationPeripheral;

    if (aRequest->iSourcePeripheral != GPDMA_PERIPHERAL_MEMORY)
        flow |= GPDMA_FLOW_CONTROL_SOURCE_IS_PERIPHERAL;
    if (aRequest->iDestinationPeripheral != GPDMA_PERIPHERAL_MEMORY)
        flow |= GPDMA_FLOW_CONTROL_DESTINATION_IS_PERIPHERAL;

    if (aRequest->iFlowControl == GPDMA_FLOW_CONTROL_DMA) {
        flow |= GPDMA_FLOW_CONTROL_DMA_CONTROLLER;
    } else if (aRequest->iFlowControl == GPDMA_FLOW_CONTROL_SOURCE_PERIPHERAL) {
        flow |= GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
    } else if (aRequest->iFlowControl
        == GPDMA_FLOW_CONTROL_DESTINATION_PERIPHERAL) {
        if (aRequest->iSourcePeripheral != GPDMA_PERIPHERAL_MEMORY)
            flow = GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
        else
            flow |= GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
    }

    // Setup flow control
    p->iConfiguration = ((flow << DMACCConfiguration_FlowCntrl_BIT)
        & DMACCConfiguration_FlowCntrl_MASK) | DMACCConfiguration_E;

    // If the callback is set, process interrupts.
    if (aISRCallback)
        p->iConfiguration |= DMACCConfiguration_IE | DMACCConfiguration_ITC;

    // If the source is a peripheral, configure the type
    if (aRequest->iSourcePeripheral != GPDMA_PERIPHERAL_MEMORY) {
        perip = IPeripheralToIndex(aRequest->iSourcePeripheral);
        if (perip == GPDMA_PERIPHERAL_UNKNOWN)
            return UEZ_ERROR_INVALID_PARAMETER;
        p->iConfiguration |= ((perip << DMACCConfiguration_SrcPeripheral_BIT)
            & DMACCConfiguration_SrcPeripheral_MASK);
    }

    // If the destination is a peripheral, configure the type
    if (aRequest->iDestinationPeripheral != GPDMA_PERIPHERAL_MEMORY) {
        perip = IPeripheralToIndex(aRequest->iDestinationPeripheral);
        if (perip == GPDMA_PERIPHERAL_UNKNOWN)
            return UEZ_ERROR_INVALID_PARAMETER;
        p->iConfiguration |= ((perip << DMACCConfiguration_DestPeripheral_BIT)
            & DMACCConfiguration_DestPeripheral_MASK);
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPDMA_BurstRequest
 *---------------------------------------------------------------------------*
 * Description:
 *      Generate a GPDMA Burst Request for the given peripheral
 * Inputs:
 *      void *aWorkspace                -- Particular GPDMA workspace
 *      T_gpdmaPeripheral aPeripheral   -- Peripheral to handle request
 * Outputs:
 *      T_uezError                  -- Error code, UEZ_ERROR_NOT_FOUND
 *                                      if peripheral not supported.
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPDMA_BurstRequest(
    void *aWorkspace,
    T_gpdmaPeripheral aPeripheral)
{
    TUInt32 b;
    PARAM_NOT_USED(aWorkspace);

    b = IPeripheralToIndex(aPeripheral);
    if (b == GPDMA_PERIPHERAL_UNKNOWN)
        return UEZ_ERROR_NOT_FOUND;
    LPC_GPDMA->SoftBReq = (1<<b);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPDMA_SingleRequest
 *---------------------------------------------------------------------------*
 * Description:
 *      Generate a GPDMA Single Request for the given peripheral
 * Inputs:
 *      void *aWorkspace                -- Particular GPDMA workspace
 *      T_gpdmaPeripheral aPeripheral   -- Peripheral to handle request
 * Outputs:
 *      T_uezError                  -- Error code, UEZ_ERROR_NOT_FOUND
 *                                      if peripheral not supported.
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPDMA_SingleRequest(
    void *aWorkspace,
    T_gpdmaPeripheral aPeripheral)
{
    TUInt32 b;
    PARAM_NOT_USED(aWorkspace);

    b = IPeripheralToIndex(aPeripheral);
    if (b == GPDMA_PERIPHERAL_UNKNOWN)
        return UEZ_ERROR_NOT_FOUND;
    LPC_GPDMA->SoftSReq = (1<<b);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPDMA_LastBurstRequest
 *---------------------------------------------------------------------------*
 * Description:
 *      Generate a GPDMA Last Burst Request for the given peripheral
 * Inputs:
 *      void *aWorkspace                -- Particular GPDMA workspace
 *      T_gpdmaPeripheral aPeripheral   -- Peripheral to handle request
 * Outputs:
 *      T_uezError                  -- Error code, UEZ_ERROR_NOT_FOUND
 *                                      if peripheral not supported.
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPDMA_LastBurstRequest(
    void *aWorkspace,
    T_gpdmaPeripheral aPeripheral)
{
    TUInt32 b;
    PARAM_NOT_USED(aWorkspace);

    b = IPeripheralToIndex(aPeripheral);
    if (b == GPDMA_PERIPHERAL_UNKNOWN)
        return UEZ_ERROR_NOT_FOUND;
    LPC_GPDMA->SoftLBReq = (1<<b);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPDMA_LastSingleRequest
 *---------------------------------------------------------------------------*
 * Description:
 *      Generate a GPDMA Last Single Request for the given peripheral
 * Inputs:
 *      void *aWorkspace                -- Particular GPDMA workspace
 *      T_gpdmaPeripheral aPeripheral   -- Peripheral to handle request
 * Outputs:
 *      T_uezError                  -- Error code, UEZ_ERROR_NOT_FOUND
 *                                      if peripheral not supported.
 *---------------------------------------------------------------------------*/
T_uezError LPC17xx_40xx_GPDMA_LastSingleRequest(
    void *aWorkspace,
    T_gpdmaPeripheral aPeripheral)
{
    TUInt32 b;
    PARAM_NOT_USED(aWorkspace);

    b = IPeripheralToIndex(aPeripheral);
    if (b == GPDMA_PERIPHERAL_UNKNOWN)
        return UEZ_ERROR_NOT_FOUND;
    LPC_GPDMA->SoftLSReq = (1<<b);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC17xx_40xx_GPDMA_IsValidAddress
 *---------------------------------------------------------------------------*
 * Description:
 *      Determine if the GPDMA is valid
 * Inputs:
 *      TUInt32 aAddr               -- Address to check if GPDMA works here
 * Outputs:
 *      TBool                       -- ETrue if valid, else EFalse
 *---------------------------------------------------------------------------*/
static TBool LPC17xx_40xx_GPDMA_IsValidAddress(TUInt32 aAddr)
{
    // On the LPC17xx_40xx, all addresses are valid
    return ETrue;
}

/*---------------------------------------------------------------------------*
 * Routine:  IGPDMAProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Generic routine for handling any of the dma channels (as passed
 *      into the routine.
 *      NOTE:  This routine is ALWAYS processed inside of a interrupt
 *              service routine.
 * Inputs:
 *      T_LPC17xx_40xx_GPDMA_Workspace *p      -- Port's definition to process interrupt
 *---------------------------------------------------------------------------*/
static void IGPDMAProcessInterrupt(T_LPC17xx_40xx_GPDMA_Workspace *p)
{
    T_gpdmaState state = GPDMA_UNKNOWN;

