FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_GPDMA.c
    // Check error state. Higher priority.
    if (LPC_GPDMA->IntErrStat & (1 << p->iChannel)) {
        state = GPDMA_FAIL;
    } else if (LPC_GPDMA->IntTCStat & (1 << p->iChannel)) {
        // Completed.
        state = GPDMA_SUCCESS;
    }

    // Call the callback function.
    if (NULL != p->iISRCallback)
        p->iISRCallback(p->iISRCallbackWorkspace, state);

    // Clear possible interrupt sources.
    LPC_GPDMA->IntTCClear = (1 << p->iChannel);
    LPC_GPDMA->IntErrClr = (1 << p->iChannel);
}

/*---------------------------------------------------------------------------*
 * Routine:  IGPDMA
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the GPDMA interrupt and forward to IGPDMAProcessInterrupt.
 *---------------------------------------------------------------------------*/IRQ_ROUTINE(IGPDMA)
{
    IRQ_START();
    // Determine interrupt source.
    if (LPC_GPDMA->IntStat & (1 << GPDMA_CHANNEL0)) {
        //iChannel 0 - Enable callback
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[0]);
    }
    if (LPC_GPDMA->IntStat & (1 << GPDMA_CHANNEL1)) {
        //iChannel 1
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[1]);
    }
    if (LPC_GPDMA->IntStat & (1 << GPDMA_CHANNEL2)) {
        //iChannel 2
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[2]);
    }
    if (LPC_GPDMA->IntStat & (1 << GPDMA_CHANNEL3)) {
        //iChannel 3
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[3]);
    }
    if (LPC_GPDMA->IntStat & (1 << GPDMA_CHANNEL4)) {
        //iChannel 4
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[4]);
    }
    if (LPC_GPDMA->IntStat & (1 << GPDMA_CHANNEL5)) {
        //iChannel 5
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[5]);
    }
    if (LPC_GPDMA->IntStat & (1 << GPDMA_CHANNEL6)) {
        //iChannel 6
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[6]);
    }
    if (LPC_GPDMA->IntStat & (1 << GPDMA_CHANNEL7)) {
        //iChannel 7
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel[7]);
    } IRQ_END()
    ;
}

const HAL_GPDMA LPC17xx_40xx_GPDMA_Channel0_Interface = {
    {
        "GPDMA:LPC17xx_40xx:CH0",
        0x0100,
        LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel0,
        sizeof(T_LPC17xx_40xx_GPDMA_Workspace), },
    LPC17xx_40xx_GPDMA_PrepareRequest,
    LPC17xx_40xx_GPDMA_Start,
    LPC17xx_40xx_GPDMA_Stop,
    LPC17xx_40xx_GPDMA_IsValidAddress,

    // v2.04
    LPC17xx_40xx_GPDMA_BurstRequest,
    LPC17xx_40xx_GPDMA_SingleRequest,
    LPC17xx_40xx_GPDMA_LastBurstRequest,
    LPC17xx_40xx_GPDMA_LastSingleRequest };

const HAL_GPDMA LPC17xx_40xx_GPDMA_Channel1_Interface = {
    {
        "GPDMA:LPC17xx_40xx:CH1",
        0x0100,
        LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel1,
        sizeof(T_LPC17xx_40xx_GPDMA_Workspace), },
    LPC17xx_40xx_GPDMA_PrepareRequest,
    LPC17xx_40xx_GPDMA_Start,
    LPC17xx_40xx_GPDMA_Stop,
    LPC17xx_40xx_GPDMA_IsValidAddress,

    // v2.04
    LPC17xx_40xx_GPDMA_BurstRequest,
    LPC17xx_40xx_GPDMA_SingleRequest,
    LPC17xx_40xx_GPDMA_LastBurstRequest,
    LPC17xx_40xx_GPDMA_LastSingleRequest };

const HAL_GPDMA LPC17xx_40xx_GPDMA_Channel2_Interface = {
    {
        "GPDMA:LPC17xx_40xx:CH2",
        0x0100,
        LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel2,
        sizeof(T_LPC17xx_40xx_GPDMA_Workspace), },
    LPC17xx_40xx_GPDMA_PrepareRequest,
    LPC17xx_40xx_GPDMA_Start,
    LPC17xx_40xx_GPDMA_Stop,
    LPC17xx_40xx_GPDMA_IsValidAddress,

    // v2.04
    LPC17xx_40xx_GPDMA_BurstRequest,
    LPC17xx_40xx_GPDMA_SingleRequest,
    LPC17xx_40xx_GPDMA_LastBurstRequest,
    LPC17xx_40xx_GPDMA_LastSingleRequest };

const HAL_GPDMA LPC17xx_40xx_GPDMA_Channel3_Interface = {
    {
        "GPDMA:LPC17xx_40xx:CH3",
        0x0100,
        LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel3,
        sizeof(T_LPC17xx_40xx_GPDMA_Workspace), },
    LPC17xx_40xx_GPDMA_PrepareRequest,
    LPC17xx_40xx_GPDMA_Start,
    LPC17xx_40xx_GPDMA_Stop,
    LPC17xx_40xx_GPDMA_IsValidAddress,

    // v2.04
    LPC17xx_40xx_GPDMA_BurstRequest,
    LPC17xx_40xx_GPDMA_SingleRequest,
    LPC17xx_40xx_GPDMA_LastBurstRequest,
    LPC17xx_40xx_GPDMA_LastSingleRequest };

const HAL_GPDMA LPC17xx_40xx_GPDMA_Channel4_Interface = {
    {
        "GPDMA:LPC17xx_40xx:CH4",
        0x0100,
        LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel4,
        sizeof(T_LPC17xx_40xx_GPDMA_Workspace), },
    LPC17xx_40xx_GPDMA_PrepareRequest,
    LPC17xx_40xx_GPDMA_Start,
    LPC17xx_40xx_GPDMA_Stop,
    LPC17xx_40xx_GPDMA_IsValidAddress,

    // v2.04
    LPC17xx_40xx_GPDMA_BurstRequest,
    LPC17xx_40xx_GPDMA_SingleRequest,
    LPC17xx_40xx_GPDMA_LastBurstRequest,
    LPC17xx_40xx_GPDMA_LastSingleRequest };

const HAL_GPDMA LPC17xx_40xx_GPDMA_Channel5_Interface = {
    {
        "GPDMA:LPC17xx_40xx:CH5",
        0x0100,
        LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel5,
        sizeof(T_LPC17xx_40xx_GPDMA_Workspace), },
    LPC17xx_40xx_GPDMA_PrepareRequest,
    LPC17xx_40xx_GPDMA_Start,
    LPC17xx_40xx_GPDMA_Stop,
    LPC17xx_40xx_GPDMA_IsValidAddress,

    // v2.04
    LPC17xx_40xx_GPDMA_BurstRequest,
    LPC17xx_40xx_GPDMA_SingleRequest,
    LPC17xx_40xx_GPDMA_LastBurstRequest,
    LPC17xx_40xx_GPDMA_LastSingleRequest };

const HAL_GPDMA LPC17xx_40xx_GPDMA_Channel6_Interface = {
    {
        "GPDMA:LPC17xx_40xx:CH6",
        0x0100,
        LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel6,
        sizeof(T_LPC17xx_40xx_GPDMA_Workspace), },
    LPC17xx_40xx_GPDMA_PrepareRequest,
    LPC17xx_40xx_GPDMA_Start,
    LPC17xx_40xx_GPDMA_Stop,
    LPC17xx_40xx_GPDMA_IsValidAddress,

    // v2.04
    LPC17xx_40xx_GPDMA_BurstRequest,
    LPC17xx_40xx_GPDMA_SingleRequest,
    LPC17xx_40xx_GPDMA_LastBurstRequest,
    LPC17xx_40xx_GPDMA_LastSingleRequest };

const HAL_GPDMA LPC17xx_40xx_GPDMA_Channel7_Interface = {
    {
        "GPDMA:LPC17xx_40xx:CH7",
        0x0100,
        LPC17xx_40xx_GPDMA_InitializeWorkspace_Channel7,
        sizeof(T_LPC17xx_40xx_GPDMA_Workspace), },
    LPC17xx_40xx_GPDMA_PrepareRequest,
    LPC17xx_40xx_GPDMA_Start,
    LPC17xx_40xx_GPDMA_Stop,
    LPC17xx_40xx_GPDMA_IsValidAddress,

    // v2.04
    LPC17xx_40xx_GPDMA_BurstRequest,
    LPC17xx_40xx_GPDMA_SingleRequest,
    LPC17xx_40xx_GPDMA_LastBurstRequest,
    LPC17xx_40xx_GPDMA_LastSingleRequest };

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC17xx_40xx_GPDMA0_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE()
    ;
    HALInterfaceRegister("GPDMA0",
        (T_halInterface *)&LPC17xx_40xx_GPDMA_Channel0_Interface, 0, 0);
}

void LPC17xx_40xx_GPDMA1_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE()
    ;
    HALInterfaceRegister("GPDMA1",
        (T_halInterface *)&LPC17xx_40xx_GPDMA_Channel1_Interface, 0, 0);
}

void LPC17xx_40xx_GPDMA2_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE()
    ;
    HALInterfaceRegister("GPDMA2",
        (T_halInterface *)&LPC17xx_40xx_GPDMA_Channel2_Interface, 0, 0);
}

void LPC17xx_40xx_GPDMA3_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE()
    ;
    HALInterfaceRegister("GPDMA3",
        (T_halInterface *)&LPC17xx_40xx_GPDMA_Channel3_Interface, 0, 0);
}

void LPC17xx_40xx_GPDMA4_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE()
    ;
    HALInterfaceRegister("GPDMA4",
        (T_halInterface *)&LPC17xx_40xx_GPDMA_Channel4_Interface, 0, 0);
}

void LPC17xx_40xx_GPDMA5_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE()
    ;
    HALInterfaceRegister("GPDMA5",
        (T_halInterface *)&LPC17xx_40xx_GPDMA_Channel5_Interface, 0, 0);
}

void LPC17xx_40xx_GPDMA6_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE()
    ;
    HALInterfaceRegister("GPDMA6",
        (T_halInterface *)&LPC17xx_40xx_GPDMA_Channel6_Interface, 0, 0);
}

void LPC17xx_40xx_GPDMA7_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE()
    ;
    HALInterfaceRegister("GPDMA7",
        (T_halInterface *)&LPC17xx_40xx_GPDMA_Channel7_Interface, 0, 0);
}

/*-------------------------------------------------------------------------*
 * End of File:  GPDMA.c
 *-------------------------------------------------------------------------*/
